src/posts/2024/03/code-explains-for-fragment-shader-in-shadertoy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-03 Sun 14:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ShaderToy常见代码解释 (收录中)</title>
<meta name="author" content="saltb0rn" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">ShaderToy常见代码解释 (收录中)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org303bc17">1. 计算片元在屏幕上的 UV 坐标</a></li>
</ul>
</div>
</div>
<div class="abstract" id="org5e0ec9b">
<p>
在编程这一方面, 个人认同这一个观点: 要想实现某个东西最有效的办法是抄别人的代码, 并且要抄得明白.
</p>

<p>
不要看这句话看似很 <code>low</code>, 它里面其实有这么一些对应关系, "抄得明白"对应知道原理, "抄别人代码"对应实践.
</p>

<p>
对于 <code>ShaderToy</code> 也是一样的, 你想像那些前辈一样实现酷炫的效果, 就得脸皮厚一点去抄明白他们的代码.
</p>

<p>
这篇笔记就是用来记录"明白"这一过程.
</p>

</div>

<div id="outline-container-org303bc17" class="outline-2">
<h2 id="org303bc17"><span class="section-number-2">1.</span> 计算片元在屏幕上的 UV 坐标</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
写于 2024/3/3
</p>
</blockquote>

<p>
<code>OpenGL</code> 的 <code>UV</code> 坐标是一个左下角为原点, 向上为 \(U\), 向右为 \(V\), 且范围都是 \([0, 1]\) 的坐标系.
</p>

<p>
在 <code>ShaderToy</code> 中, 人们把整个画面看作是一张大贴图, 片元就是该大贴图上面的一个纹理像素(texel).
</p>

<p>
理所当然的片元就有一个 <code>UV</code> 坐标, 可以通过片元坐标 \(gl\_fragCoord\) 和屏幕分辨率 \(iResolution\) 计算出来.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #98fb98;">vec2</span> <span style="color: #eedd82;">uv</span> = gl_FragCoord.xy / iResolution.xy; <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">[0.0, 1.0]</span>
</pre>
</div>

<p>
当要注意的是, 为了方便作图, 片元的 <code>UV</code> 并非就要固定在 \([0.0, 1.0]\) 之间.
</p>

<p>
有时候为了方便作图, 会对 <code>UV</code> 做一些列变换.
</p>

<p>
比如把纹理坐标空间的原点从左下角平移到中心,
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #98fb98;">vec2</span> <span style="color: #eedd82;">uv</span> = (gl_FragCoord.xy / iResolution.xy) - 0.5; <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">[-0.5, 0.5]</span>
</pre>
</div>

<blockquote>
<p>
其实从现在开始, 我们就已经把一个屏幕平均分成 4 份了.
</p>
</blockquote>

<p>
把新的纹理坐标空间的范围拓展到 \([-1.0, 1.0]\),
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #98fb98;">vec2</span> <span style="color: #eedd82;">uv</span> = 2 * ((gl_FragCoord.xy / iResolution.xy) - 0.5); <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">[-1.0, 1.0]</span>
<span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">&#21487;&#31616;&#21270;&#25104;</span>
<span style="color: #98fb98;">vec2</span> <span style="color: #eedd82;">uv</span> = 2 * (gl_FragCoord.xy / iResolution.xy) - 1;
</pre>
</div>

<p>
到目前为止, 我们的 <code>UV</code> 计算都是针对屏幕分辨率比例是一比一的情况.
</p>

<p>
在非一比一情况下绘制个圆形会导致圆变椭圆, 这是因为 <b>\(UV\) 两分量的范围比例和屏幕分辨率比例对不上</b>, 导致出现拉伸的情况.
</p>

<p>
解决方法很简单, 对长的那一方维度进行补偿,
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #98fb98;">vec2</span> <span style="color: #eedd82;">uv</span> = 2 * (gl_FragCoord.xy / iResolution.xy) - 1; <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">[-1.0, 1.0]</span>
<span style="color: #00ffff;">if</span> (iResolution.x &gt; iResolution.y) {
  <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">&#22914;&#26524;&#23631;&#24149;&#30340; X &#36724;&#27604; Y &#36724;&#38271;</span>
  uv.x *= iResolution.x / iResolution.y;
} <span style="color: #00ffff;">else</span> {
  <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">&#22914;&#26524;&#23631;&#24149;&#30340; Y &#36724;&#27604; X &#36724;&#38271;, &#25110;&#20004;&#32773;&#30456;&#31561;</span>
  uv.y *= iResolution.y / iResolution.x;
}
</pre>
</div>

<p>
到目前位置我相信大部分人都能看得懂, 但 <code>ShaderToy</code> 上的例子大部分都是把这段代码简化成一句的.
</p>

<p>
现在来逐个分析,
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #98fb98;">vec2</span> <span style="color: #eedd82;">uv</span> = 2 * (gl_FragCoord.xy / iResolution.xy) - 1;
<span style="color: #ff7f24;">/*</span>
<span style="color: #ff7f24;">  &#31561;&#21516;&#20110;</span>

<span style="color: #ff7f24;">  uv = (2 * gl_FragCoord.xy) / iResolution.xy - iResolution.xy / iResolution.xy</span>
<span style="color: #ff7f24;">  uv = (2 * gl_FragCoord.xy - iResolution.xy) / iResolution.xy</span>

<span style="color: #ff7f24;">  &#21516;&#26102;&#21487;&#20197;&#25286;&#24320;&#26469;&#30475;</span>

<span style="color: #ff7f24;">  uv.x = (2 * gl_FragCoord.x - iResolution.x) / iResolution.x</span>
<span style="color: #ff7f24;">  uv.y = (2 * gl_FragCoord.y - iResolution.y) / iResolution.y</span>
<span style="color: #ff7f24;">*/</span>

<span style="color: #00ffff;">if</span> (iResolution.x &gt; iResolution.y) {
  <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">&#22914;&#26524;&#23631;&#24149;&#30340; X &#36724;&#27604; Y &#36724;&#38271;</span>
  uv.x *= iResolution.x / iResolution.y;
  <span style="color: #ff7f24;">/*</span>
<span style="color: #ff7f24;">    &#31561;&#21516;&#20110;</span>
<span style="color: #ff7f24;">    uv.x = (2 * gl_FragCoord.x - iResolution.x) / iResolution.x * iResolution.x / iResolution.y</span>
<span style="color: #ff7f24;">    uv.x = (2 * gl_FragCoord.x - iResolution.x) / iResolution.y</span>

<span style="color: #ff7f24;">    &#22914;&#26524;&#21644; y &#20998;&#37327;&#21512;&#24182;&#19968;&#36215;&#35745;&#31639;, &#37027;&#20040;&#23601;&#26159;</span>
<span style="color: #ff7f24;">    uv = (2 * gl_FragCoord.xy - iResolution.xy) / iResolution.y</span>
<span style="color: #ff7f24;">   */</span>
} <span style="color: #00ffff;">else</span> {
  <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">&#22914;&#26524;&#23631;&#24149;&#30340; Y &#36724;&#27604; X &#36724;&#38271;, &#25110;&#20004;&#32773;&#30456;&#31561;</span>
  uv.y *= iResolution.y / iResolution.x;
  <span style="color: #ff7f24;">/*</span>
<span style="color: #ff7f24;">    &#31561;&#21516;&#20110;</span>
<span style="color: #ff7f24;">    uv.y = (2 * gl_FragCoord.y - iResolution.y) / iResolution.y * iResolution.y / iResolution.x</span>
<span style="color: #ff7f24;">    uv.y = (2 * gl_FragCoord.y - iResolution.y) / iResolution.x</span>

<span style="color: #ff7f24;">    &#22914;&#26524;&#21644; x &#20998;&#37327;&#21512;&#24182;&#19968;&#36215;&#35745;&#31639;, &#37027;&#20040;&#23601;&#26159;</span>
<span style="color: #ff7f24;">    uv = (2 * gl_FragCoord.xy - iResolution.xy) / iResolution.x</span>
<span style="color: #ff7f24;">   */</span>
}
<span style="color: #ff7f24;">/*</span>
<span style="color: #ff7f24;">  &#32508;&#21512;&#20004;&#31181;&#24773;&#20917;&#26469;&#30475;&#23601;&#26159;</span>
<span style="color: #ff7f24;">  uv = (2 * gl_FragCoord.xy - iResolution.xy) / min(iResolution.x, iResolution.y)</span>
<span style="color: #ff7f24;"> */</span>
</pre>
</div>

<p>
所以, <code>ShaderToy</code> 上有不少例子都是有这一句(或类似的)
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #98fb98;">vec2</span> <span style="color: #eedd82;">uv</span> = (2 * gl_FragCoord.xy - iResolution.xy) / min(iResolution.x, iResolution.y);
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2024-03-02</p>
<p class="author">Author: saltb0rn</p>
<p class="date">Created: 2024-03-03 Sun 14:10</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
